legacy/app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `produk`
SELECT COUNT(*) AS `numrows` FROM `pesanan`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'pembeli'
SELECT *
FROM `produk`
ORDER BY `stok` ASC
 LIMIT 5
---
    public function index()
    {
        $redirect = $this->cekAdmin();
        if ($redirect) return $redirect;

        $db           = \Config\Database::connect();
        $produkModel  = new ProdukModel();
        $pesananModel = new PesananModel();
        $usersModel   = new UsersModel();

        $revenue = $db->query("SELECT COALESCE(SUM(total_harga),0) as total FROM pesanan WHERE status = 'selesai'")->getRow();
        $pending = $db->query("SELECT COUNT(*) as total FROM pesanan WHERE status = 'pending'")->getRow();

        // Hitung jumlah produk per kategori
        $rows = $db->query("SELECT kategori, COUNT(*) as total FROM produk WHERE kategori IS NOT NULL GROUP BY kategori")->getResultArray();
        $kat_counts = [];
        foreach ($rows as $row) {
            $kat_counts[$row['kategori']] = $row['total'];
        }

        $data = [
            'total_produk'    => $produkModel->countAll(),
            'total_pesanan'   => $pesananModel->countAll(),
            'total_user'      => $usersModel->where('role', 'pembeli')->countAllResults(),
            'total_revenue'   => $revenue->total ?? 0,
            'total_pending'   => $pending->total ?? 0,
            'pesanan_terbaru' => $pesananModel->getAllWithUser(),
            'produk_terlaris' => $produkModel->orderBy('stok', 'ASC')->limit(5)->findAll(),
            'kat_counts'      => $kat_counts,
        ];