legacy/app/Controllers/Admin/Kelola.php

SELECT *
FROM `users`
ORDER BY `id_user` ASC
---
    public function pengguna()
    {
        $r = $this->cekAdmin();
        if ($r) return $r;

        $model = new UsersModel();
        return view('admin/kelola/pengguna', [
            'users' => $model->orderBy('id_user', 'ASC')->findAll()
        ]);