legacy/app/Controllers/Admin/Products.php

    public function index()
    {
        $r = $this->cekAdmin();
        if ($r) return $r;
        $model  = new ProdukModel();
        $produk = $model->orderBy('id_produk', 'DESC')->findAll();
---
SELECT *
FROM `produk`
ORDER BY `id_produk` DESC