app/Controllers/Admin/Laporan.php

SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `status` = 'selesai'
SELECT *
FROM `produk`
ORDER BY `stok` ASC
---
    public function penjualan()
    {
        $r = $this->cekAdmin();
        if ($r) return $r;

        $db      = \Config\Database::connect();
        $revenue = $db->query("SELECT COALESCE(SUM(total_harga),0) as total FROM pesanan WHERE status='selesai'")->getRow();
        $terjual = $db->query("SELECT COALESCE(SUM(jumlah),0) as total FROM detail_pesanan")->getRow();
        $rows    = $db->query("SELECT kategori, COUNT(*) as total FROM produk WHERE kategori IS NOT NULL GROUP BY kategori")->getResultArray();

        $kat_counts = [];
        foreach ($rows as $row) {
            $kat_counts[$row['kategori']] = $row['total'];
        }

        return view('admin/laporan/penjualan', [
            'total_revenue' => $revenue->total ?? 0,
            'total_terjual' => $terjual->total ?? 0,
            'total_pesanan' => (new PesananModel())->where('status', 'selesai')->countAllResults(),
            'produk_list'   => (new ProdukModel())->orderBy('stok', 'ASC')->findAll(),