legacy/app/Models/PesananModel.php

SELECT *
FROM `pesanan`
WHERE `id_user` = '3'
ORDER BY `tanggal` DESC
---
    public function getByUser($id_user)
    {
        return $this->where('id_user', $id_user)
            ->orderBy('tanggal', 'DESC')
            ->findAll();

SELECT `p`.*, `u`.`nama`, `u`.`email`, `u`.`alamat`
FROM `pesanan` `p`
JOIN `users` `u` ON `u`.`id_user` = `p`.`id_user`
ORDER BY `p`.`tanggal` DESC
---
    public function getAllWithUser()
    {
        return $this->db->table('pesanan p')
            ->select('p.*, u.nama, u.email, u.alamat')
            ->join('users u', 'u.id_user = p.id_user')
            ->orderBy('p.tanggal', 'DESC')
            ->get()->getResultArray();