legacy/app/Models/ProdukModel.php

SELECT *
FROM `produk`
WHERE `stok` > 0
ORDER BY `kategori` ASC
---
    public function getAllAktif()
    {
        return $this->where('stok >', 0)->orderBy('kategori', 'ASC')->findAll();