app/Controllers/Cart.php

    public function tambah()
    {
        if (! session()->get('id_user')) {
            return redirect()->to('/login')->with('error', 'Login dulu untuk belanja.');
        }

        $id_produk = $this->request->getPost('id_produk');
        $jumlah    = (int) $this->request->getPost('jumlah') ?: 1;

        $model  = new ProdukModel();
        $produk = $model->find($id_produk);
---
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '13'