app/Models/UsersModel.php

SELECT *
FROM `users`
WHERE `email` = 'handikacp155@gmail.com'
 LIMIT 1
---
    public function findByEmail($email)
    {
        return $this->where('email', $email)->first();